"use strict"

// 1. Сумма отрицательных элементов массива
// 2. Замените все отрицательные элементы массива на ноль
// 3. Найдите произведение элементов массива , которые меньше 10, но положительные
// 4. Выведите индексы нулевых элементов массива (которые равны нулю), сохраняя результат в отдельный массив
// 5. Вернуть первые N элемента массива

// 6* найдите максимальный элемент массива

// 7* найдите сумму элементов двух массивов , учитывая что у них может быть разная длина
// 8* переместить элемент массива : тоесть обменять например 2 и 5 элементы местами - это значит 2 элемент станет на место 5-го, а 5-й элемент станет вторым